Repository: THE-GULU/checkout_com
Catalog: checkout_com_frames/lib/src/l10n/arb/intl_*.arb
Languages: ro

# placeholderCardNumber
source: Card number*
ro: Numar de Card

# errorCardNumber
source: The card number is invalid
ro: Introduceti un numar de card valid

# labelExpirationDate
source: Expiration date*
ro: Date expirarii*

# errorExpirationDate
source: Enter a valid date
ro: Introduceti o data valida

# placeholderCvv
source: Cvv*
ro: Cod de scuritate CVV*

# errorCvv
source: Enter a valid Cvv
ro: Introduceti un cod valid

# labelBillingDetails
source: Billing Details
ro: Adress de facturare

# selectBillingDetails
source: SELECT
ro: SELECTATI

# billingDetailsAdd
source: + ADD
ro: + ADAUGA

# buttonPay
source: Pay
ro: Plateste

# titleBillingDetails
source: Billing Details
ro: Detalii Facturare

# placeholderName
source: Cardholder's name*
ro: Nume

# errorName
source: Value must be longer then 3 characters
ro: Numele trebuie sa aiba minim 3 caractere

# placeholderCountry
source: SELECT COUNTRY/REGION
ro: " SELECTATI TARA"

# errorCountry
source: Please select a country/region
ro: Selectati o tara

# placeholderAddressOne
source: Address line 1*
ro: Prima linie de din adresa

# errorAddressOne
source: Value must be longer then 3 characters
ro: Adresa trebuie sa aiba minim 3 caractere

# placeholderAddressTwo
source: Address line 2
ro: A doua linie de adresa

# placeholderCity
source: Postal Town*
ro: Oras

# errorCity
source: Value must be longer then 2 characters
ro: Orasul trebuie sa aiba cel putin 2 caractere

# placeholderState
source: State
ro: Statul

# errorState
source: Value must be longer then 3 characters
ro: Statul trebuie sa contina mimim 3 caractere

# placeholderPostcode
source: Postcode*
ro: Codul postal

# errorPostcode
source: Value must be longer then 3 characters
ro: Codul postal trebuie sa contina cel putin 3 caractere

# placeholderPhone
source: Phone*
ro: Numar de telefon

# errorPhone
source: Value must be longer then 3 characters
ro: Numarul de telefon trebuie sa contina cel putin 3 caractere

# buttonClear
source: Clear
ro: Reseteaza

# buttonDone
source: Done
ro: Gata

# billingDetailsEdit
source: Edit
ro: EditeazÄƒ
